OpenFOAM-2.3.0/tutorials/multiphase/twoPhaseEulerFoam/RAS/fluidisedBed/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             Euler;
}

gradSchemes
{
    default     Gauss linear;
}

divSchemes
{
    default                     none;

    "div\(phi,alpha.*\)"        Gauss vanLeer;
    "div\(phir,alpha.*\)"       Gauss vanLeer;

    "div\(alphaPhi.*,U.*\)"     Gauss limitedLinearV 1;
    "div\(phi.*,U.*\)"          Gauss limitedLinearV 1;
    "div\(alphaPhi.*,.*rho.*\)" Gauss linear;

    "div\(alphaPhi.*,(h|e).*\)" Gauss limitedLinear 1;
    "div\(alphaPhi.*,(K.*|p)\)" Gauss limitedLinear 1;

    div(alphaPhi.particles,Theta.particles) Gauss limitedLinear 1;

    "div\(alphaPhi.*,(k|epsilon).*\)"  Gauss limitedLinear 1;

    "div\(\(\(alpha.*nuEff.*\)*dev2\(T\(grad\(U.*\)\)\)\)\)" Gauss linear;

    div(((nut.particles*dev2(T(grad(U.particles))))+((lambda.particles*div(phi.particles))*I)))  Gauss linear;
}

laplacianSchemes
{
    default     Gauss linear uncorrected;
    bounded     Gauss linear uncorrected;
}

interpolationSchemes
{
    default     linear;
}

snGradSchemes
{
    default     uncorrected;
    bounded     uncorrected;
}

fluxRequired
{
    default     no;
    p           ;
    alpha.particles;
}


// ************************************************************************* //
